Revit 2026 API

# FailuresAccessorGetTransactionName Method

---

Retrieves the name of the transaction for which failures are being processed.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetTransactionName()
```
```vb
Public Function GetTransactionName As String
```
```cpp
public:
String^ GetTransactionName()
```
```fsharp
member GetTransactionName : unit -> string
```

#### Return Value

String The name of the transaction for which failures are being processed.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

#### Reference

FailuresAccessor Class

Autodesk.Revit.DB Namespace